In [210]:
import pandas as pd

In [211]:
import numpy as np

In [212]:
df = pd.read_csv('../SynMax/Population Data.csv')

In [213]:
df2 = pd.read_csv('../Synmax/Temperature Data.csv')

In [214]:
type(df2)

pandas.core.frame.DataFrame

In [215]:
type(df)

pandas.core.frame.DataFrame

In [216]:
df.shape

(285, 5)

In [217]:
df2.shape

(89219, 9)

In [218]:
df.head()

         City          State  population       Lon      Lat
0   Henderson         Nevada      260068 -115.0375  36.0122
1  Manchester  New Hampshire      109830  -71.4439  42.9847
2   Elizabeth     New Jersey      125660  -74.1935  40.6663
3      Newark     New Jersey      277540  -74.1726  40.7242
4    Paterson     New Jersey      146427  -74.1628  40.9147

In [219]:
df2.head()

,name,country_name,country_code,continent,station_code,location_date,temp_mean_c,temp_min_c,temp_max_c
0,Atlanta,UnitedStates,USA,North America,KATL,4/20/2021,17.491667,12.2,23.3
1,Windsor Locks,UnitedStates,USA,North America,KBDL,4/20/2021,13.887500,3.9,22.2
2,Nashville,UnitedStates,USA,North America,KBNA,4/20/2021,15.175000,6.7,23.3
3,Boise,UnitedStates,USA,North America,KBOI,4/20/2021,9.329167,1.7,15.6
4,Boston,UnitedStates,USA,North America,KBOS,4/20/2021,16.716667,10.0,23.9

In [220]:
df

                City          State  population       Lon      Lat
0          Henderson         Nevada      260068 -115.0375  36.0122
1         Manchester  New Hampshire      109830  -71.4439  42.9847
2          Elizabeth     New Jersey      125660  -74.1935  40.6663
3             Newark     New Jersey      277540  -74.1726  40.7242
4           Paterson     New Jersey      146427  -74.1628  40.9147
..               ...            ...         ...       ...      ...
280            Miami        Florida      408750  -80.2086  25.7752
281        Hollywood        Florida      143357  -80.1646  26.0311
282  Fort Lauderdale        Florida      168528  -80.1439  26.1413
283    Pompano Beach        Florida      101617  -80.1290  26.2426
284  West Palm Beach        Florida      101043  -80.1266  26.7483

[285 rows x 5 columns]

In [221]:
df2

,name,country_name,country_code,continent,station_code,location_date,temp_mean_c,temp_min_c,temp_max_c
0,Atlanta,UnitedStates,USA,North America,KATL,4/20/2021,17.491667,12.2,23.3
1,Windsor Locks,UnitedStates,USA,North America,KBDL,4/20/2021,13.887500,3.9,22.2
2,Nashville,UnitedStates,USA,North America,KBNA,4/20/2021,15.175000,6.7,23.3
3,Boise,UnitedStates,USA,North America,KBOI,4/20/2021,9.329167,1.7,15.6
4,Boston,UnitedStates,USA,North America,KBOS,4/20/2021,16.716667,10.0,23.9
...,...,...,...,...,...,...,...,...,...
89214,Sacramento/Execu,UnitedStates,USA,North America,KSAC,1/1/2015,3.500000,-1.7,10.6
89215,Portland,UnitedStates,USA,North America,KPWM,1/1/2015,-3.454167,-7.8,-0.6
89216,Raleigh/Durham,UnitedStates,USA,North America,KRDU,1/1/2015,3.291667,-4.4,10.6
89217,Pittsburgh,UnitedStates,USA,North America,KPIT,1/1/2015,-2.570833,-6.7,1.7
89218,Phoenix/Sky HRBR,UnitedStates,USA,North America,KPHX,1/1/2015,4.354167,1.7,7.2

In [222]:
df.columns

Index(['City', 'State', 'population', 'Lon', 'Lat'], dtype='object')

In [223]:
df2.columns

Index(['name', 'country_name', 'country_code', 'continent', 'station_code',
       'location_date', 'temp_mean_c', 'temp_min_c', 'temp_max_c'],
      dtype='object')

In [224]:
df.values

array([['Henderson', 'Nevada', 260068, -115.0375, 36.0122],
       ['Manchester', 'New Hampshire', 109830, -71.4439, 42.9847],
       ['Elizabeth', 'New Jersey', 125660, -74.1935, 40.6663],
       ...,
       ['Fort Lauderdale', 'Florida', 168528, -80.1439, 26.1413],
       ['Pompano Beach', 'Florida', 101617, -80.129, 26.2426],
       ['West Palm Beach', 'Florida', 101043, -80.1266, 26.7483]],
      dtype=object)

In [225]:
df2.values

array([['Atlanta', 'UnitedStates', 'USA', ..., 17.4916667, 12.2, 23.3],
       ['Windsor Locks', 'UnitedStates', 'USA', ..., 13.8875, 3.9, 22.2],
       ['Nashville', 'UnitedStates', 'USA', ..., 15.175, 6.7, 23.3],
       ...,
       ['Raleigh/Durham', 'UnitedStates', 'USA', ..., 3.2916667, -4.4,
        10.6],
       ['Pittsburgh', 'UnitedStates', 'USA', ..., -2.5708333, -6.7, 1.7],
       ['Phoenix/Sky HRBR', 'UnitedStates', 'USA', ..., 4.3541667, 1.7,
        7.2]], dtype=object)

In [226]:
df2bydate = df2.groupby(['location_date', 'name'])[['temp_mean_c', 'temp_min_c', 'temp_max_c']].agg(np.mean)

In [227]:
df2bydate

                                temp_mean_c  temp_min_c  temp_max_c
location_date name
1/1/2015      Albany              -3.362500        -7.2         0.0
              Atlanta              6.758333         0.0        13.9
              Baltimore           -0.345833        -7.8         6.1
              Boise              -11.070833       -13.9        -8.0
              Boston              -2.329167        -5.6         0.6
...                                     ...         ...         ...
9/9/2020      Spokane             17.358333         8.9        26.1
              St Louis/Lambert    23.937500        19.4        29.4
              Wash DC/Dulles      23.179167        20.0        26.1
              Washington          24.229167        22.8        26.1
              Windsor Locks       22.425000        18.3        27.8

[86932 rows x 3 columns]

In [228]:
df2bydate.interpolate()

                                temp_mean_c  temp_min_c  temp_max_c
location_date name
1/1/2015      Albany              -3.362500        -7.2         0.0
              Atlanta              6.758333         0.0        13.9
              Baltimore           -0.345833        -7.8         6.1
              Boise              -11.070833       -13.9        -8.0
              Boston              -2.329167        -5.6         0.6
...                                     ...         ...         ...
9/9/2020      Spokane             17.358333         8.9        26.1
              St Louis/Lambert    23.937500        19.4        29.4
              Wash DC/Dulles      23.179167        20.0        26.1
              Washington          24.229167        22.8        26.1
              Windsor Locks       22.425000        18.3        27.8

[86932 rows x 3 columns]

In [229]:
df2bydate['temp_mean_c'].isnull().values.any()

False

In [230]:
df2bydate['temp_min_c'].isnull().values.any()

False

In [231]:
df2bydate['temp_max_c'].isnull().values.any()

False

In [232]:
df2.isnull().values.any()

False

In [233]:
df.isnull().values.any()

False

In [234]:
cnt2 = 0
cities2 = []
for i in range(0, len(df2)):
    if df2['name'][i] not in cities2:
        cities2.append(df2['name'][i])
        cnt2 += 1

print("No of unique cities:", cnt2)
print("Cities:", cities2)

No of unique cities: 38
Cities: ['Atlanta', 'Windsor Locks', 'Nashville', 'Boise', 'Boston', 'Buffalo', 'Burbank', 'Baltimore', 'Columbus', 'Los Angeles', 'Covington', 'Washington', 'Denver', 'Dallas', 'Detroit/Wayne', 'Fresno', 'Spokane', 'Wash DC/Dulles', 'Houston', 'Las Vegas', 'NYC/LaGuardia', 'Little Rock', 'Memphis', 'Minneapolis', 'New Orleans', "Chicago O'Hare", 'Portland', 'Philadelphia', 'Phoenix/Sky HRBR', 'Pittsburgh', 'Raleigh/Durham', 'Richmond', 'Sacramento/Execu', 'Seattle', 'San Francisco', 'Salt Lake City', 'St Louis/Lambert', 'Albany']

In [235]:
cnt1 = 0
cities1 = []
for i in range(0, len(df)):
    if df['City'][i] not in cities:
        cities1.append(df['City'][i])
        cnt1 += 1

print("No of unique cities:", cnt)
print("Cities:", cities1)

No of unique cities: 332
Cities: ['Henderson', 'Manchester', 'Elizabeth', 'Newark', 'Paterson', 'Jersey City', 'Albuquerque', 'Rochester', 'Syracuse', 'New York', 'Yonkers', 'Charlotte', 'Winston–Salem', 'High Point', 'Greensboro', 'Fayetteville', 'Durham', 'Cary', 'Raleigh', 'Wilmington', 'Fargo', 'Cincinnati', 'Dayton', 'Toledo', 'Cleveland', 'Akron', 'Oklahoma City', 'Norman', 'Tulsa', 'Broken Arrow', 'Eugene', 'Salem', 'Gresham', 'Erie', 'Allentown', 'Providence', 'Columbia', 'Charleston', 'Sioux Falls', 'Clarksville', 'Murfreesboro', 'Chattanooga', 'Knoxville', 'El Paso', 'Odessa', 'Midland', 'Lubbock', 'Amarillo', 'Abilene', 'Laredo', 'Wichita Falls', 'Killeen', 'Round Rock', 'Brownsville', 'Fort Worth', 'Waco', 'Corpus Christi', 'Denton', 'Arlington', 'Grand Prairie', 'Irving', 'Carrollton', 'Frisco', 'Plano', 'Richardson', 'McKinney', 'Garland', 'Mesquite', 'Pasadena', 'Beaumont', 'West Valley City', 'West Jordan', 'Provo', 'Alexandria', 'Newport News', 'Chesapeake', 'Hampton', 'Norfolk', 'Virginia Beach', 'Vancouver', 'Tacoma', 'Kent', 'Everett', 'Bellevue', 'Madison', 'Green Bay', 'Milwaukee', 'Costa Mesa', 'West Covina', 'Santa Ana', 'Orange', 'Irvine', 'Pomona', 'Anaheim', 'Ontario', 'Rancho Cucamonga', 'Corona', 'Fontana', 'Riverside', 'Rialto', 'Victorville', 'Oceanside', 'San Bernardino', 'Carlsbad', 'Moreno Valley', 'Murrieta', 'San Diego', 'Temecula', 'Escondido', 'Chula Vista', 'El Cajon', 'Lakewood', 'Arvada', 'Fort Collins', 'Westminster', 'Thornton', 'Centennial', 'Colorado Springs', 'Pueblo', 'Aurora', 'Stamford', 'Bridgeport', 'Athens', 'Augusta', 'Savannah', 'Honolulu', 'Springfield', 'Peoria', 'Rockford', 'Elgin', 'Aurora', 'Naperville', 'Joliet', 'Chicago', 'Evansville', 'South Bend', 'Indianapolis', 'Fort Wayne', 'Des Moines', 'Cedar Rapids', 'Davenport', 'Wichita', 'Topeka', 'Olathe', 'Kansas City', 'Overland Park', 'Louisville', 'Lexington', 'Shreveport', 'Lafayette', 'Baton Rouge', 'Springfield', 'Worcester', 'Lowell', 'Cambridge', 'Grand Rapids', 'Lansing', 'Ann Arbor', 'Flint', 'Detroit', 'Sterling Heights', 'Warren', 'Saint Paul', 'Rochester', 'Jackson', 'Kansas City', 'Independence', 'Springfield', 'Columbia', 'St. Louis', 'Billings', 'Lincoln', 'Omaha', 'Reno', 'North Las Vegas', 'San Antonio', 'McAllen', 'Austin', 'Mobile', 'Birmingham', 'Huntsville', 'Montgomery', 'Anchorage', 'Surprise', 'Peoria', 'Glendale', 'Phoenix', 'Tempe', 'Chandler', 'Scottsdale', 'Gilbert', 'Mesa', 'Tucson', 'Santa Rosa', 'Daly City', 'Berkeley', 'Vallejo', 'Oakland', 'Hayward', 'Fairfield', 'Sunnyvale', 'Concord', 'Santa Clara', 'Fremont', 'San Jose', 'Antioch', 'Salinas', 'Sacramento', 'Elk Grove', 'Stockton', 'Roseville', 'Modesto', 'Santa Maria', 'Visalia', 'San Buenaventura (Ventura)', 'Oxnard', 'Bakersfield', 'Thousand Oaks', 'Simi Valley', 'Santa Clarita', 'Inglewood', 'Torrance', 'Glendale', 'Lancaster', 'Long Beach', 'Pasadena', 'Downey', 'Palmdale', 'Norwalk', 'El Monte', 'Huntington Beach', 'Garden Grove', 'Fullerton', 'Waterbury', 'New Haven', 'Hartford', 'Tallahassee', 'Clearwater', 'Saint Petersburg', 'Tampa', 'Gainesville', 'Cape Coral', 'Jacksonville', 'Orlando', 'Palm Bay', 'Port Saint Lucie', 'Pembroke Pines', 'Miramar', 'Hialeah', 'Coral Springs', 'Miami Gardens', 'Miami', 'Hollywood', 'Fort Lauderdale', 'Pompano Beach', 'West Palm Beach']